import math
# ; 2. Напишите программу, которая будет принимать на вход дробь и показывать первую цифру дробной части числа.
    
# ;     *Примеры:*
    
# ;     - 6.78 -> 7
# ;     - 5 -> нет
# ;     - 0.34 -> 3


a = abs(int(input('a = ')))
r = - a
while r !=a:
     print(r)
     r = r + 1
else:
    print(a)


