# Шаги для настройки:
# Перейдите к: Файл> Настройки> сочетания клавиш
# Затем в строке поиска выполните поиск focus terminal
# Выберитеworkbench.action.terminal.focus, а затем CTRL+k или нажмите пользовательскую клавишу, 
# а затем нажмите enter.
# Аналогично, в строке поиска выполните поиск focus active  editor group
# Выберитеworkbench.action.focusActiveEditorGroup, а затем нажмите CTRL+j или нажмите пользовательскую клавишу, а затем 
# нажмите enter.
# После вышеуказанной настройки:
# Нажмите CTRL+k, чтобы сфокусировать курсор на терминале
# Нажмите CTRL+j, чтобы сфокусировать курсор на разделе кодирования, не закрывая терминал
