# 1 - Напишите программу, которая принимает на вход вещественное 
# число и показывает сумму его цифр. Учтите, что числа могут быть отрицательными
# Пример:
# 67.82 -> 23
# (-0.56) -> 11

number = list (input('Введите вещественное число: '))
# for (number%10 = 0):
#     a = number%10
print(number%10)
print(number//10)

# print(number[2:])
# print(word[:2])
# print(word[1:3])
# # thon
# # py
# # yt


# sum = number%10

# for i in range(0, number):
#     i+=1
#     print(number)